data/Подписанные файлы/Без подписи/outbound1

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><S:Header><ISRequestHeader xmlns="http://dom.gosuslugi.ru/schema/integration/8.6.0.6/" xmlns:ns2="http://dom.gosuslugi.ru/schema/integration/8.6.0.6/organizations-registry-common/"><Date>2016-03-22T10:23:52.609+06:00</Date><MessageGUID>a66d7ca6-ba62-48a5-af8d-0bee95937a2c</MessageGUID></ISRequestHeader></S:Header><S:Body><ns2:exportDataProviderRequest xmlns:ns2="http://dom.gosuslugi.ru/schema/integration/8.6.0.6/organizations-registry-common/" xmlns="http://dom.gosuslugi.ru/schema/integration/8.6.0.6/" Id="signed-data-container"></ns2:exportDataProviderRequest></S:Body></S:Envelope>